# SheetCurrentRevisionIssuedTo Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SheetCurrentRevisionIssuedTo Property
ParameterTypeId Class See Also
---
"Current Revision Issued To"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SheetCurrentRevisionIssuedTo { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetCurrentRevisionIssuedTo As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SheetCurrentRevisionIssuedTo {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace